var __extends = (this && this.__extends) || (function () {
    var extendStatics = Object.setPrototypeOf ||
        ({ __proto__: [] } instanceof Array && function (d, b) { d.__proto__ = b; }) ||
        function (d, b) { for (var p in b) if (b.hasOwnProperty(p)) d[p] = b[p]; };
    return function (d, b) {
        extendStatics(d, b);
        function __() { this.constructor = d; }
        d.prototype = b === null ? Object.create(b) : (__.prototype = b.prototype, new __());
    };
})();
var SceneCreateUser = /** @class */ (function (_super) {
    __extends(SceneCreateUser, _super);
    function SceneCreateUser() {
        var _this = _super.call(this) || this;
        _this.sex = 1;
        _this.view = fairygui.UIPackage.createObject("common", "SceneCreateUser").asCom;
        _this.view.setSize(fairygui.GRoot.inst.width, fairygui.GRoot.inst.height);
        _this.view.addRelation(fairygui.GRoot.inst, fairygui.RelationType.Size);
        _this.addChild(_this.view);
        _this.lbl_user = _this.view.getChild("lbl_user").asTextInput;
        _this.btn_create = _this.view.getChild("btn_create").asButton;
        _this.t0 = _this.view.getTransition("t0");
        _this.btn_tab = _this.view.getController("btn_tab");
        _this.btn_change = _this.view.getChild("btn_change").asButton;
        GameUtils.addClickListener(_this.btn_create, _this.onCreate, _this);
        GameUtils.addClickListener(_this.btn_change, _this.nameChange, _this);
        _this.btn_tab.on(fairygui.Events.STATE_CHANGED, _this, function () {
            this.t0.play();
        });
        _this.createMc();
        return _this;
    }
    SceneCreateUser.getInstance = function () {
        if (this.instance == null)
            this.instance = new SceneCreateUser();
        return this.instance;
    };
    SceneCreateUser.prototype.onCreate = function () {
        if (this.lbl_user.text != "") {
            Player.userName = this.lbl_user.text;
            Player.userType = this.btn_tab.selectedIndex + 1;
            GameContainer.getInstance().loadScene(new SceneMain());
        }
        else
            UI.Toast.show("请输入昵称");
    };
    SceneCreateUser.prototype.nameChange = function () {
        var first_name_tbl = ["王", "李", "张", "刘", "陈", "杨", "黄", "周", "赵", "吴", "孙", "徐", "林", "胡", "朱", "郭", "梁", "马", "高", "何", "郑", "罗", "宋", "谢", "叶", "韩", "任", "潘", "唐", "于", "冯", "董", "吕", "邓", "许", "曹", "曾", "袁", "程", "田", "彭", "钟", "蔡", "魏", "沈", "卢", "余", "杜", "蒋", "汪", "丁", "方", "苏", "贾", "姜", "姚", "陆", "戴", "傅", "夏", "廖", "萧", "石", "范", "金", "谭", "邹", "崔", "薛", "邱", "史", "江", "侯", "邵", "肖", "熊", "康", "秦", "雷", "孟", "白", "毛", "阎", "郝", "钱", "段", "俞", "洪", "顾", "贺", "龚", "庞", "尹", "万", "龙", "赖", "孔", "武", "邢", "颜", "汤", "章", "梅", "常", "阮", "黎", "倪", "施", "乔", "樊", "严", "齐", "陶", "温", "易", "兰", "文", "闫", "芦", "牛", "安", "向", "管", "殷", "霍", "翟", "佘", "葛", "伍", "辛", "练", "申", "付", "曲", "焦", "代", "鲁", "季", "覃", "毕", "麦", "耿", "舒", "尚", "聂", "庄", "项", "盛", "童", "祝", "柴", "柳", "单", "岳", "阳", "骆", "纪", "欧", "左", "尤", "凌", "韦", "景", "詹", "莫", "路", "宁", "关", "丛", "翁", "容", "柯", "鲍", "蒲", "苗", "牟", "谷", "裴", "包", "游", "司", "祁", "靳", "甘", "席", "瞿", "欧阳", "令狐", "皇甫", "宫", "佟", "雍", "糜", "公冶", "伯赏", "轩辕", "长孙", "司马", "鲜于", "司空", "单于", "夏侯", "上官", "南宫", "诸葛", "巫马", "阳佟", "太叔", "东方", "尉迟", "呼延", "慕容", "宇文", "淳于", "子车", "闾丘", "东郭", "归海", "赫连", "乐正", "濮阳", "西门", "百里", "司徒", "左丘", "公西", "谷粱", "拓跋"];
        var female_name_tbl = ["思", "烟", "冰", "琴", "夜", "蓝", "痴", "梦", "依", "丹", "小", "柳", "香", "冬", "绿", "萍", "向", "菱", "映", "寒", "阳", "含", "曼", "霜", "春", "白", "南", "醉", "丝", "之", "新", "真", "雨", "露", "天", "云", "寄", "芙", "如", "筠", "容", "若", "涵", "荷", "风", "亦", "儿", "采", "雪", "谷", "巧", "凌", "山", "安", "蕾", "从", "芷", "芹", "绮", "雅", "柔", "飞", "又", "忆", "灵", "晓", "卉", "夏", "乐", "岚", "蓉", "笑", "萱", "珍", "彤", "妙", "蕊", "元", "碧", "翠", "半", "千", "凡", "初", "兰", "代", "晴", "珊", "易", "平", "怀", "青", "友", "幻", "慕", "玉", "秋", "语", "觅", "瑶", "恨", "幼", "傲", "文", "双", "冷", "竹", "沛", "念", "凝", "书", "桃", "寻", "菡", "水", "紫", "惜", "诗", "孤", "枫", "梅", "雁", "盼", "旋", "尔", "松", "以", "蝶", "靖", "莲", "柏", "波", "迎", "问", "薇", "海", "宛", "槐", "怜", "听", "静", "访", "吉", "娜", "妮", "琪", "然", "娴", "祯", "荌", "奥", "婷", "维", "北", "辰", "嘉", "晶", "贝", "莉", "丽", "琲", "瓃", "蓓", "琳", "莹", "洁", "心", "彦", "博", "敏", "布", "侬", "欣", "衣", "偲", "彩", "妍", "灿", "婵", "娟", "畅", "唱", "月", "朝", "旭", "琛", "瑞", "晨", "曦", "楚", "芳", "华", "娇", "燕", "英", "淳", "美", "慈", "聪", "慧", "睿", "茵", "黛", "娥", "红", "溪", "笛", "韵", "典", "丁", "端", "懿", "多", "朵", "婀", "恩", "霈", "璠", "瑜", "方", "仪", "蔼", "菲", "馥", "蕙", "林", "苓", "荃", "蕤", "润", "馨", "泽", "洲", "霏", "斐", "芬", "丰", "熙", "甘", "高", "歌", "阑", "格", "葛", "古", "瑰", "玮", "桂", "帆", "芝", "女", "景", "秀", "晗", "玥", "好", "浩", "皓", "合", "和", "璧", "暖", "悌", "煦", "暄", "怡", "豫", "悦", "河", "珠", "赫", "鹤", "姮", "弘", "豆", "叶", "闳", "虹", "星", "颖", "影", "婉", "欢", "会", "雯", "彗", "惠", "婕", "君", "艳", "玟", "季", "霁", "芸", "佳", "家", "宝", "禾", "淑", "歆", "言", "音", "江", "姣", "皎", "杰", "今", "金", "枝", "津", "童", "锦", "瑾", "菁", "辉", "滢", "靓", "恬", "逸", "菊", "绢", "子", "隽", "俊", "珺", "俐", "琦", "娅", "可", "琨", "尹", "朗", "宁", "姝", "楠", "伶", "玲", "琅", "珑", "铃", "令", "流", "芦", "罗", "洛", "妃", "玛", "麦", "蔓", "吟", "嫚", "花", "萌", "蒙", "孟", "桐", "米", "密", "淼", "婧", "颜", "意", "珉", "闵", "叡", "名", "明", "鸣", "茗", "茉", "木", "牧", "暮", "乃", "囡", "霓", "旎", "远", "妞", "浓", "佩", "杉", "芃", "彭", "嫔", "品", "良", "璞", "齐", "其", "奇", "颀", "启", "芊", "茜", "倩", "俏", "轩", "卿", "清", "昶", "晖", "舒", "一", "漪", "卓", "情", "画", "霞", "琼", "荣", "曲", "冉", "苒", "荏", "任", "溶", "城", "融", "谨", "绚", "茹", "濡", "芮", "澜", "优", "绣", "哲", "姿", "莎", "三", "姗", "森", "沙", "羽", "善", "韶", "邵", "沈", "施", "世", "艺", "抒", "穆", "贤", "贞", "扬", "帅", "顺", "萝", "祺", "微", "司", "嫒", "宸", "迪", "义", "斯", "乔", "素", "昕", "棠", "洮", "陶", "宜", "骄", "籁", "媛", "田", "谧", "默", "甜", "湉", "莞", "奕", "菀", "琬", "琰", "望", "熹", "韦", "苇", "未", "央", "蔚", "墨", "梧", "西", "希", "喜", "雰", "璇", "仙", "闲", "咸", "羡", "献", "湘", "宵", "萧", "箫", "诺", "忻", "愉", "跃", "莘", "苗", "杏", "修", "媚", "越", "梓", "琇", "玄", "玑", "翎", "漫", "爱", "致", "嫣", "芫", "俨", "晏", "桦", "舞", "杨", "洋", "漾", "岑", "野", "农", "晔", "璐", "颐", "佁", "倚", "怿", "轶", "银", "饮", "胤", "莺", "瑛", "琭", "樱", "璎", "盈", "萦", "渟", "雍", "悠", "瑗", "攸", "余", "璟", "环", "珂", "爰", "源", "恺", "来", "人", "淡", "亭", "韫", "磬", "蕴", "赞", "湛", "昭", "正", "宇", "知", "智", "仲", "筱", "庄", "榆"];
        var male_name_tbl = ["锦", "程", "修", "杰", "烨", "伟", "尔", "曼", "立", "辉", "致", "远", "天", "思", "友", "绿", "聪", "健", "洁", "访", "琴", "初", "彤", "谷", "雪", "平", "灵", "源", "智", "华", "振", "家", "越", "彬", "乞", "子", "轩", "宸", "晋", "鹏", "觅", "松", "海", "亦", "戾", "嵩", "邑", "瑛", "鸿", "卿", "裘", "契", "涛", "疾", "驳", "凛", "逊", "鹰", "威", "紊", "阁", "康", "焱", "城", "誉", "祥", "虔", "胜", "穆", "豁", "匪", "霆", "凡", "枫", "豪", "铭", "罡", "扬", "垣", "师", "翼", "秋", "傥", "雨", "珍", "浩", "宇", "嘉", "熙", "志", "泽", "苑", "博", "念", "波", "峻", "俊", "驰", "展", "南", "问", "旋", "黎", "昕", "凝", "靖", "易", "芷", "烟", "渊", "煜", "祺", "乐", "驹", "风", "箴", "睿", "超", "磊", "夜", "白", "晴", "雍", "达", "乾", "鑫", "萧", "鲂", "冥", "翰", "丑", "隶", "钧", "坤", "荆", "蹇", "骁", "沅", "剑", "勒", "筮", "磬", "戎", "翎", "函", "嚣", "炳", "耷", "惮", "鞯", "擎", "烙", "遥", "斩", "颤", "孱", "续", "岩", "奄", "瑾", "瑜", "飞", "弘", "文", "迎", "笑", "诗", "云", "航", "映", "代", "桃", "晓", "啸", "琪", "十", "八", "君", "绍", "冷", "安", "盼", "鹤", "绯", "匕", "奎", "仰", "霸", "乌", "邴", "败", "捕", "糜", "汲", "涔", "班", "悲", "臻", "厉", "栾", "井", "伊", "储", "羿", "富", "稀", "寇", "碧", "珩", "靳", "鞅", "弼", "焦", "德", "铁", "身", "老", "黑", "半", "邪", "山", "一", "江", "冰", "皓", "默", "熠", "青", "寒", "愚", "筠", "旭", "尧", "妙", "之", "阳", "正", "明", "行", "恶", "哲", "瀚", "骞", "洋", "竹", "幼", "百", "招", "不", "斜", "汉", "千", "万", "高", "烽", "大", "开", "帮", "如", "豹", "三", "毒", "连", "虎", "酬", "川", "复", "牛", "羊", "楚", "傀", "斗", "五", "九", "定", "自", "中", "似", "狮", "无", "声", "手", "严", "四", "可", "随", "阴", "有", "延", "世", "倌", "岱", "周", "苍", "懿", "煊", "晟", "强", "炫", "寄", "听", "孤", "怜", "然", "昊", "诚", "通", "醉", "薇", "蓝", "仇", "成", "英", "若", "难", "破", "地", "施", "追", "命", "协", "人", "亿", "先", "评", "忘", "幽", "广", "雄", "言", "摧", "危", "元", "龙", "仁", "敌", "阑", "士", "铸", "伯", "头", "霖", "佑", "书", "芹", "从", "寻", "菡", "槐", "果", "楷", "瑞", "炎", "沛", "尤", "道", "愁", "筹", "缘", "奇", "望", "乘", "心", "绝", "抒", "鸣", "鬼", "仙", "封", "锋", "与", "断", "悟", "消", "血", "极", "神", "满", "语", "堂", "雅", "水", "柳", "荣", "绮", "慕", "蕊", "鹭", "金", "柏", "建", "梦", "丝", "侵", "刀", "怨", "寿", "送", "终", "河", "花", "灭", "聋", "义", "非", "沧", "二", "空", "晗", "昱", "日", "涵", "畅", "涤", "亮", "忍", "容", "润", "煦", "蓄", "衍", "意", "育", "采", "池", "翮", "林", "墨", "学", "音", "玥", "藻", "漠", "穹", "宕", "荡", "歌", "涆", "慨", "旷", "阔", "漫", "淼", "渺", "邈", "气", "穰", "壤", "和", "蔼", "璧", "昶", "光", "洽", "惬", "顺", "硕", "颂", "泰", "悌", "同", "宜", "怡", "玉", "裕", "豫", "悦", "韵", "方", "厚", "化", "济", "量", "深", "盛", "图", "新", "业", "益", "毅", "壮", "宏", "才", "放", "浚", "恺", "朗", "茂", "儒", "爽", "逸", "宝", "彩", "畴", "福", "晖", "羲", "禧", "信", "羽", "运", "祯", "卓", "奥", "灿", "藏", "美", "清", "刚", "捷", "昂", "岑", "澹", "芬", "峯", "峰", "格", "丽", "旻", "兴", "谊", "原", "赫", "霁", "临", "启", "耀", "国", "冠", "赐", "良", "木", "纳", "年", "庆", "石", "实", "树", "澍", "歆", "许", "勋", "颖", "坚", "壁", "秉", "本", "茗", "章", "经", "赋", "亘", "略", "纶", "纬", "武", "艺", "景", "澄", "焕", "向", "晨", "笛", "翔", "项", "禹", "欣", "怿", "觉", "知", "鸥", "邦", "昌", "朝", "发", "怀", "生", "腾", "旺", "为", "贤", "星", "辰", "火", "津", "洲", "谨", "能", "齐", "永", "真", "民", "名", "惠", "珺", "飙", "飇", "舒", "朔", "曦", "夏", "曜", "州", "烁", "春", "蕴", "范", "锐", "叡", "韶", "卫", "彦", "奕", "喆", "资", "纵", "长", "丰", "宁", "圣", "勇", "尚", "专", "用", "敏", "贞", "咏", "男", "军", "寰", "荫", "泉", "基", "甲", "凯", "魁", "忠", "藉", "童", "游", "湛", "力", "夫", "勤", "群", "材", "策", "工", "吉", "骥", "骏", "朋", "理", "全", "礼", "双", "承", "恩", "教", "嗣", "宣", "颜", "允", "载", "馨", "庸"];
        function getLastName(sex) {
            var tbl = [];
            if (this.sex == 200)
                tbl = male_name_tbl;
            else
                tbl = female_name_tbl;
            var str = tbl[GameUtils.random(0, tbl.length)];
            var strB = tbl[GameUtils.random(0, tbl.length)];
            return str + strB;
        }
        var first_name = first_name_tbl[GameUtils.random(0, first_name_tbl.length)];
        var last_name = getLastName(this.sex);
        this.lbl_user.text = first_name + last_name;
    };
    SceneCreateUser.prototype.createMc = function () {
        for (var i = 0; i < 20; i++) {
            var flower = fairygui.UIPackage.createObject("common", "createRole_ceshi_00" + GameUtils.random(1, 3)).asImage;
            this.addChild(flower);
            flower.x = GameUtils.random(0, 640);
            flower.y = -50;
            var timeline = new Laya.TimeLine();
            timeline.to(flower, { x: GameUtils.random(0, 640), y: GameUtils.random(200, 430), alpha: 0 }, 4000, Laya.Ease.cubicInOut, 0);
            timeline.play(GameUtils.random(0, 4000), true);
        }
    };
    return SceneCreateUser;
}(fairygui.GComponent));
//# sourceMappingURL=SceneCreateUser.js.map